Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "Light threads" are just a special kind of Lua coroutines that are scheduled by the ngx_lua module.
zh_cn: "轻量线程" 其实是一种特殊的由ngx_lua调度的Lua coroutine.

source: "Light threads" are mostly useful for doing concurrent upstream requests in a single Nginx request handler, kinda like a generalized version of [[#ngx.location.capture_multi|ngx.location.capture_multi]] that can work with all the [[#Nginx API for Lua|Nginx API for Lua]].
zh_cn: "轻量线程" 对于在一个Nginx请求处理器中实现并发的上游请求最有用, 有些象一个更一般化的可以与所有 [[#Nginx API for Lua|Nginx API for Lua]]一起使用的 [[#ngx.location.capture_multi|ngx.location.capture_multi]] .

source: # return ngx.arg[1]..ngx.arg[2]
zh_cn: # 返回 ngx.arg[1]..ngx.arg[2]

source: # $ngx_prefix/conf/concat.lua contents:
zh_cn: # $ngx_prefix/conf/concat.lua 的内容:

source: # Download the latest version of Nginx [http://nginx.org/ HERE] (See [[#Nginx Compatibility|Nginx Compatibility]])
zh_cn: # 从 [http://nginx.org/ 这里]下载Nginx的最新版本 (见[[#Nginx Compatibility|Nginx兼容性]])

source: # Download the latest version of ngx_lua [http://github.com/chaoslawful/lua-nginx-module/tags HERE].
zh_cn: # 从 [http://github.com/chaoslawful/lua-nginx-module/tags 这里]下载ngx_lua的最新版本.

source: # Download the latest version of the ngx_devel_kit (NDK) module [http://github.com/simpl/ngx_devel_kit/tags HERE].
zh_cn: # 从 [http://github.com/simpl/ngx_devel_kit/tags 这里] 下载ngx_devel_kit (NDK) 模块的最新版本.

source: # Here we assume Nginx is to be installed under /opt/nginx/.
zh_cn: # 这里我们假设Nginx安装到 /opt/nginx/.

source: # Install LuaJIT 2.0 (recommended) or Lua 5.1 (Lua 5.2 is ''not'' supported yet).
zh_cn: # 安装 LuaJIT 2.0 (推荐) 或 Lua 5.1 (Lua 5.2 ''尚'' 不支持).

source: # MIME type determined by default_type:
zh_cn: # 使用默认的 MIME 类型:

source: # POST request with body 'a%20b=1%61+2'
zh_cn: # POST 体为 'a%20b=1%61+2'

source: # Post request with the body 'foo=bar&bar=baz&bar=blah'
zh_cn: # Post请求体为 'foo=bar&bar=baz&bar=blah'

source: # Use data storage mechanisms such as <code>memcached</code>, <code>redis</code>, <code>MySQL</code> or <code>PostgreSQL</code>.
zh_cn: # 使用 <code>memcached</code>, <code>redis</code>, <code>MySQL</code> 或r <code>PostgreSQL</code> 之类的存储机制.

source: # Use only a single nginx worker and a single server (this is however not recommended when there is a multi core CPU or multiple CPUs in a single machine).
zh_cn: # 仅使用一个nginx worker和一个 server (在多核或多CPU的机器上不推荐这么做).

source: # WARN: contents in nginx var must be carefully filtered,
zh_cn: # 注意：nginx 变量中的内容必须被小心过滤

source: # absolute script path not modified
zh_cn: # 直接使用绝对路径

source: # creating a ticket on the [http://github.com/chaoslawful/lua-nginx-module/issues GitHub Issue Tracker], # or posting to the [[#Community|OpenResty community]].
zh_cn: # 提交bug到 [http://github.com/chaoslawful/lua-nginx-module/issues GitHub Issue Tracker], # 或发邮件到 [[#Community|OpenResty community]].

source: # evaluates to "1234" </geshi>
zh_cn: # 值为 "1234" </geshi>

source: # force reading request body (default off)
zh_cn: # 强制读取 request body (默认关闭)

source: # inline Lua script
zh_cn: # 内嵌Lua脚本

source: # or tell where to find Lua if using Lua instead:
zh_cn: # 如果使用Lua就告诉它在哪里找到Lua:

source: # otherwise there'll be great security risk!
zh_cn: # 否则会产生巨大的安全漏洞!

source: # script path relative to nginx prefix
zh_cn: # 使用相对于$ngx_prefix的脚本路径

source: # set search paths for Lua external libraries written in C (can also use ';;'):
zh_cn: # 设置用C编写的外部库的查找路径 (也可以使用 ';;'):

source: # set search paths for pure Lua external libraries (';;' is the default path):
zh_cn: # 设置纯Lua编写的外部库的查找路径 (';;' 是默认查找路径):

source: # tell nginx's build system where to find LuaJIT:
zh_cn: # 告诉Nginx编译系统在哪里找到 LuaJIT:

source: # transparent non-blocking I/O in Lua via subrequests
zh_cn: # 在Lua中使用subrequests进行透明的非阻塞I/O

source: # try access /nginx_var?a=hello,world
zh_cn: # 试试访问 /nginx_var?a=hello,world

source: # use nginx var in code path
zh_cn: # 在代码路径中使用 nginx 变量

source: # whether the current request body is already larger than the [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]], # and whether [[HttpCoreModule#client_body_in_file_only|client_body_in_file_only]] has been switched on.
zh_cn: # 当前请求体是否已经超过了 [[HttpCoreModule#client_body_buffer_size|client_body_buffer_size]] 的大小, # 是否打开了 [[HttpCoreModule#client_body_in_file_only|client_body_in_file_only]] .

source: '''WARNING''' Be careful when calling this method on dictionaries with a really huge number of keys.
zh_cn: '''警告''' 对键真的很多的字典要小心使用本方法。

source: '''WARNING''' When reading from an Nginx variable, Nginx will allocate memory in the per-request memory pool which is freed only at request termination.
zh_cn: '''警告''' 在读取Nginx变量时, Nginx将在每个请求的内存池中分配内存，只有当请求结束时，这个内存池才被释放。

source: '''context:''' ''http''
zh_cn: '''可包含于:''' ''http''

source: '''context:''' ''http, server, location''
zh_cn: '''可包含于:''' ''http, server, location''

source: '''context:''' ''http, server, location, location if''
zh_cn: '''可包含于:''' ''http, server, location, location if''

source: '''context:''' ''http, server, location, location-if''
zh_cn: '''可包含于:''' ''http, server, location, location-if''

source: '''context:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua*, log_by_lua*, ngx.timer.*''
zh_cn: '''可包含于:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua*, log_by_lua*, ngx.timer.*''

source: '''context:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''
zh_cn: '''可包含于:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''

source: '''context:''' ''location, location if''
zh_cn: '''可包含于:''' ''location, location if''

source: '''context:''' ''main | server | location''
zh_cn: '''可包含于:''' ''main | server | location''

source: '''context:''' ''main''
zh_cn: '''可包含于:''' ''main''

source: '''context:''' ''main, server, location, location if''
zh_cn: '''可包含于:''' ''main, server, location, location if''

source: '''context:''' ''rewrite_by_lua*, access_by_lua*, content_by_lua*''
zh_cn: '''可包含于:''' ''rewrite_by_lua*, access_by_lua*, content_by_lua*''

source: '''context:''' ''rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*''
zh_cn: '''可包含于:''' ''rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*''

source: '''context:''' ''rewrite_by_lua*, access_by_lua*, content_by_lua*, ngx.timer.*''
zh_cn: '''可包含于:''' ''rewrite_by_lua*, access_by_lua*, content_by_lua*, ngx.timer.*''

source: '''context:''' ''server, server if, location, location if''
zh_cn: '''可包含于:''' ''server, server if, location, location if''

source: '''context:''' ''set_by_lua*, body_filter_by_lua*''
zh_cn: '''可包含于:''' ''set_by_lua*, body_filter_by_lua*''

source: '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*''
zh_cn: '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*''

source: '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*''
zh_cn: '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*''

source: '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua''
zh_cn: '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua''

source: '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua*''
zh_cn: '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua*''

source: '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua*, log_by_lua*''
zh_cn: '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua*, log_by_lua*''

source: '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua*, log_by_lua*, ngx.timer.*''
zh_cn: '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua*, log_by_lua*, ngx.timer.*''

source: '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*''
zh_cn: '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*''

source: '''default:''' ''The content of LUA_CPATH environment variable or Lua's compiled-in defaults.''
zh_cn: '''默认值:''' ''环境变量LUA_CPATH的内容或 Lua编译时指定的默认值.''

source: '''default:''' ''The content of LUA_PATH environ variable or Lua's compiled-in defaults.''
zh_cn: '''默认值:''' ''The content of LUA_PATH environ variable or Lua's compiled-in defaults.''

source: '''default:''' ''lua_check_client_abort off''
zh_cn: '''默认值:''' ''lua_check_client_abort off''

source: '''default:''' ''lua_code_cache on''
zh_cn: '''默认值:''' ''lua_code_cache on''

source: '''default:''' ''lua_http10_buffering on''
zh_cn: '''默认值:''' ''lua_http10_buffering on''

source: '''default:''' ''lua_max_pending_timers 1024''
zh_cn: '''默认值:''' ''lua_max_pending_timers 1024''

source: '''default:''' ''lua_max_running_timers 256''
zh_cn: '''默认值:''' ''lua_max_running_timers 256''

source: '''default:''' ''lua_regex_cache_max_entries 1024''
zh_cn: '''默认值:''' ''lua_regex_cache_max_entries 1024''

source: '''default:''' ''lua_regex_match_limit 0''
zh_cn: '''默认值:''' ''lua_regex_match_limit 0''

source: '''default:''' ''lua_socket_buffer_size 4k/8k''
zh_cn: '''默认值:''' ''lua_socket_buffer_size 4k/8k''

source: '''default:''' ''lua_socket_connect_timeout 60s''
zh_cn: '''默认值:''' ''lua_socket_connect_timeout 60s''

source: '''default:''' ''lua_socket_keepalive_timeout 60s''
zh_cn: '''默认值:''' ''lua_socket_keepalive_timeout 60s''

source: '''default:''' ''lua_socket_log_errors on''
zh_cn: '''默认值:''' ''lua_socket_log_errors on''

source: '''default:''' ''lua_socket_pool_size 30''
zh_cn: '''默认值:''' ''lua_socket_pool_size 30''

source: '''default:''' ''lua_socket_read_timeout 60s''
zh_cn: '''默认值:''' ''lua_socket_read_timeout 60s''

source: '''default:''' ''lua_socket_send_lowat 0''
zh_cn: '''默认值:''' ''lua_socket_send_lowat 0''

source: '''default:''' ''lua_socket_send_timeout 60s''
zh_cn: '''默认值:''' ''lua_socket_send_timeout 60s''

source: '''default:''' ''lua_transform_underscores_in_response_headers on''
zh_cn: '''默认值:''' ''lua_transform_underscores_in_response_headers on''

source: '''default:''' ''no''
zh_cn: '''默认值:''' ''no''

source: '''default:''' ''off''
zh_cn: '''默认值:''' ''off''

source: '''default:''' ''rewrite_by_lua_no_postpone off''
zh_cn: '''默认值:''' ''rewrite_by_lua_no_postpone off''

source: '''phase:''' ''access tail''
zh_cn: '''执行阶段:''' ''access tail''

source: '''phase:''' ''content''
zh_cn: '''执行阶段:''' ''content''

source: '''phase:''' ''depends on usage''
zh_cn: '''执行阶段:''' ''depends on usage''

source: '''phase:''' ''loading-config''
zh_cn: '''执行阶段:''' ''loading-config''

source: '''phase:''' ''log''
zh_cn: '''执行阶段:''' ''log''

source: '''phase:''' ''output-body-filter''
zh_cn: '''执行阶段:''' ''output-body-filter''

source: '''phase:''' ''output-header-filter''
zh_cn: '''执行阶段:''' ''output-header-filter''

source: '''phase:''' ''rewrite tail''
zh_cn: '''执行阶段:''' ''rewrite tail''

source: '''phase:''' ''server-rewrite, rewrite''
zh_cn: '''执行阶段:''' ''server-rewrite, rewrite''

source: '''syntax:''' ''access_by_lua <lua-script-str>''
zh_cn: '''语法:''' ''access_by_lua <lua-script-str>''

source: '''syntax:''' ''access_by_lua_file <path-to-lua-script-file>''
zh_cn: '''语法:''' ''access_by_lua_file <path-to-lua-script-file>''

source: '''syntax:''' ''body_filter_by_lua <lua-script-str>''
zh_cn: '''语法:''' ''body_filter_by_lua <lua-script-str>''

source: '''syntax:''' ''body_filter_by_lua_file <path-to-lua-script-file>''
zh_cn: '''语法:''' ''body_filter_by_lua_file <path-to-lua-script-file>''

source: '''syntax:''' ''content_by_lua <lua-script-str>''
zh_cn: '''语法:''' ''content_by_lua <lua-script-str>''

source: '''syntax:''' ''content_by_lua_file <path-to-lua-script-file>''
zh_cn: '''语法:''' ''content_by_lua_file <path-to-lua-script-file>''

source: '''syntax:''' ''data, err, partial = tcpsock:receive(pattern?)''
zh_cn: '''语法:''' ''data, err, partial = tcpsock:receive(pattern?)''

source: '''syntax:''' ''dict = ngx.shared[name_var]''
zh_cn: '''语法:''' ''dict = ngx.shared[name_var]''

source: '''syntax:''' ''header_filter_by_lua <lua-script-str>''
zh_cn: '''语法:''' ''header_filter_by_lua <lua-script-str>''

source: '''syntax:''' ''header_filter_by_lua_file <path-to-lua-script-file>''
zh_cn: '''语法:''' ''header_filter_by_lua_file <path-to-lua-script-file>''

source: '''syntax:''' ''init_by_lua <lua-script-str>''
zh_cn: '''语法:''' ''init_by_lua <lua-script-str>''

source: '''syntax:''' ''init_by_lua_file <path-to-lua-script-file>''
zh_cn: '''语法:''' ''init_by_lua_file <path-to-lua-script-file>''

source: '''syntax:''' ''log_by_lua <lua-script-str>''
zh_cn: '''语法:''' ''log_by_lua <lua-script-str>''

source: '''syntax:''' ''log_by_lua_file <path-to-lua-script-file>''
zh_cn: '''语法:''' ''log_by_lua_file <path-to-lua-script-file>''

source: '''syntax:''' ''lua_check_client_abort on|off''
zh_cn: '''语法:''' ''lua_check_client_abort on|off''

source: '''syntax:''' ''lua_http10_buffering on|off''
zh_cn: '''语法:''' ''lua_http10_buffering on|off''

source: '''syntax:''' ''lua_max_pending_timers <count>''
zh_cn: '''语法:''' ''lua_max_pending_timers <count>''

source: '''syntax:''' ''lua_max_running_timers <count>''
zh_cn: '''语法:''' ''lua_max_running_timers <count>''

source: '''syntax:''' ''lua_need_request_body <on|off>''
zh_cn: '''语法:''' ''lua_need_request_body <on|off>''

source: '''syntax:''' ''lua_package_cpath <lua-style-cpath-str>''
zh_cn: '''语法:''' ''lua_package_cpath <lua-style-cpath-str>''

source: '''syntax:''' ''lua_package_path <lua-style-path-str>''
zh_cn: '''语法:''' ''lua_package_path <lua-style-path-str>''

source: '''syntax:''' ''lua_shared_dict <name> <size>''
zh_cn: '''语法:''' ''lua_shared_dict <name> <size>''

source: '''syntax:''' ''lua_socket_buffer_size <size>''
zh_cn: '''语法:''' ''lua_socket_buffer_size <size>''

source: '''syntax:''' ''lua_socket_connect_timeout <time>''
zh_cn: '''语法:''' ''lua_socket_connect_timeout <time>''

source: '''syntax:''' ''lua_socket_keepalive_timeout <time>''
zh_cn: '''语法:''' ''lua_socket_keepalive_timeout <time>''

source: '''syntax:''' ''lua_socket_log_errors on|off''
zh_cn: '''语法:''' ''lua_socket_log_errors on|off''

source: '''syntax:''' ''lua_socket_pool_size <size>''
zh_cn: '''语法:''' ''lua_socket_pool_size <size>''

source: '''syntax:''' ''lua_socket_read_timeout <time>''
zh_cn: '''语法:''' ''lua_socket_read_timeout <time>''

source: '''syntax:''' ''lua_socket_send_lowat <size>''
zh_cn: '''语法:''' ''lua_socket_send_lowat <size>''

source: '''syntax:''' ''lua_socket_send_timeout <time>''
zh_cn: '''语法:''' ''lua_socket_send_timeout <time>''

source: '''syntax:''' ''lua_transform_underscores_in_response_headers on|off''
zh_cn: '''语法:''' ''lua_transform_underscores_in_response_headers on|off''

source: '''syntax:''' ''ok, err = tcpsock:connect("unix:/path/to/unix-domain.socket", options_table?)''
zh_cn: '''语法:''' ''ok, err = tcpsock:connect("unix:/path/to/unix-domain.socket", options_table?)''

source: '''syntax:''' ''ok, err = udpsock:setpeername("unix:/path/to/unix-domain.socket")''
zh_cn: '''语法:''' ''ok, err = udpsock:setpeername("unix:/path/to/unix-domain.socket")''

source: '''syntax:''' ''rewrite_by_lua <lua-script-str>''
zh_cn: '''语法:''' ''rewrite_by_lua <lua-script-str>''

source: '''syntax:''' ''rewrite_by_lua_file <path-to-lua-script-file>''
zh_cn: '''语法:''' ''rewrite_by_lua_file <path-to-lua-script-file>''

source: '''syntax:''' ''rewrite_by_lua_no_postpone on|off''
zh_cn: '''语法:''' ''rewrite_by_lua_no_postpone on|off''

source: '''syntax:''' ''set_by_lua $res <lua-script-str> [$arg1 $arg2 ...]''
zh_cn: '''语法:''' ''set_by_lua $res <lua-script-str> [$arg1 $arg2 ...]''

source: '''syntax:''' ''tcpsock, err = ngx.socket.connect("unix:/path/to/unix-domain.socket")''
zh_cn: '''语法:''' ''tcpsock, err = ngx.socket.connect("unix:/path/to/unix-domain.socket")''

source: '''syntax:''' ''value = ngx.header.HEADER''
zh_cn: '''语法:''' ''value = ngx.header.HEADER''

source: ''This module is not distributed with the Nginx source.'' See [[#Installation|the installation instructions]].
zh_cn: ''此模块属于第三方扩展，不包含在Nginx源码发布包中。 参阅 [[#Installation|安装]].

source: (Before the <code>v0.7.14</code> release, the "eof" flag does not work at all in subrequests.)
zh_cn: (在<code>v0.7.14</code>之前的版本中, "eof" 标记对子请求无效.)

source: (This usually just means OpenSSL should be installed while building Nginx).
zh_cn: (通常这意味着在编译Nginx时安装OpenSSL).

source: ([[#Special PCRE Sequences|Known Issue With Special PCRE Sequences]]).
zh_cn: ([[#Special PCRE Sequences|PCRE特殊序列的已知问题]]).

source: * 1.4.x (last tested: 1.4.1) * 1.3.x (last tested: 1.3.11) * 1.2.x (last tested: 1.2.9) * 1.1.x (last tested: 1.1.5) * 1.0.x (last tested: 1.0.15) * 0.9.x (last tested: 0.9.4) * 0.8.x >= 0.8.54 (last tested: 0.8.54)
zh_cn: * 1.4.x (已测试: 1.4.1) * 1.3.x (已测试 : 1.3.11) * 1.2.x (已测试: 1.2.9) * 1.1.x (已测试: 1.1.5) * 1.0.x (已测试: 1.0.15) * 0.9.x (已测试: 0.9.4) * 0.8.x >= 0.8.54 (已测试: 0.8.54)

source: * <code>'*a'</code>: reads from the socket until the connection is closed.
zh_cn: * <code>'*a'</code>: 从socket中读取，直到连接被关闭.

source: * <code>access</code> : for the context of [[#access_by_lua|access_by_lua]] or [[#access_by_lua_file|access_by_lua_file]].
zh_cn: * <code>access</code> : 可能是 [[#access_by_lua|access_by_lua]] or [[#access_by_lua_file|access_by_lua_file]] 上下文.

source: * <code>args</code> : specify the subrequest's URI query arguments (both string value and Lua tables are accepted) * <code>ctx</code> : specify a Lua table to be the [[#ngx.ctx|ngx.ctx]] table for the subrequest.
zh_cn: * <code>args</code> : 指定子请求的URI请求参数 (接受字符串值和Lua table) * <code>ctx</code> : 为子请求指定 [[#ngx.ctx|ngx.ctx]] table.

source: * <code>body</code> : specify the subrequest's request body (string value only).
zh_cn: * <code>body</code> : 指定子请求的请求体 (只允许字符串值).

source: * <code>body_filter</code> : for the context of [[#body_filter_by_lua|body_filter_by_lua]] or [[#body_filter_by_lua_file|body_filter_by_lua_file]].
zh_cn: * <code>body_filter</code> : 可能是 [[#body_filter_by_lua|body_filter_by_lua]] or [[#body_filter_by_lua_file|body_filter_by_lua_file]] 上下文.

source: * <code>content</code> : for the context of [[#content_by_lua|content_by_lua]] or [[#content_by_lua_file|content_by_lua_file]].
zh_cn: * <code>content</code> : 可能是 [[#content_by_lua|content_by_lua]] or [[#content_by_lua_file|content_by_lua_file]] 上下文.

source: * <code>copy_all_vars</code> : specify whether to copy over all the Nginx variable values of the current request to the subrequest in question.
zh_cn: * <code>copy_all_vars</code> : 指定是否将当前请求中的所有Ngin变量复制到子请求中

source: * <code>err</code>: textual error message, can be <code>"no memory"</code>.
zh_cn: * <code>err</code>: 文本错误信息, 可以是 <code>"no memory"</code>.

source: * <code>forcible</code>: a boolean value to indicate whether other valid items have been removed forcibly when out of storage in the shared memory zone.
zh_cn: * <code>forcible</code>: 布尔值，标明是否由于共享内存区的空间不够而导致其它有效项被删除.

source: * <code>header_filter</code> : for the context of [[#header_filter_by_lua|header_filter_by_lua]] or [[#header_filter_by_lua_file|header_filter_by_lua_file]].
zh_cn: * <code>header_filter</code> : 可能是 [[#header_filter_by_lua|header_filter_by_lua]] or [[#header_filter_by_lua_file|header_filter_by_lua_file]] 上下文.

source: * <code>init</code> : for the context of [[#init_by_lua|init_by_lua]] or [[#init_by_lua_file|init_by_lua_file]].
zh_cn: * <code>init</code> : 可能是 [[#init_by_lua|init_by_lua]] 或 [[#init_by_lua_file|init_by_lua_file]] 上下文.

source: * <code>log</code> : for the context of [[#log_by_lua|log_by_lua]] or [[#log_by_lua_file|log_by_lua_file]].
zh_cn: * <code>log</code> : 可能是 [[#log_by_lua|log_by_lua]] or [[#log_by_lua_file|log_by_lua_file]] 上下文.

source: * <code>method</code> : specify the subrequest's request method, which only accepts constants like <code>ngx.HTTP_POST</code>.
zh_cn: * <code>method</code> : 指定子请求的请求方法，只接受 <code>ngx.HTTP_POST</code> 这样的常量.

source: * <code>pool</code> : specify a custom name for the connection pool being used.
zh_cn: * <code>pool</code> : 自定义要使用的连接池的名称.

source: * <code>rewrite</code> : for the context of [[#rewrite_by_lua|rewrite_by_lua]] or [[#rewrite_by_lua_file|rewrite_by_lua_file]].
zh_cn: * <code>rewrite</code> : 可能是 [[#rewrite_by_lua|rewrite_by_lua]] 或 [[#rewrite_by_lua_file|rewrite_by_lua_file]] 上下文.

source: * <code>set</code> : for the context of [[#set_by_lua|set_by_lua]] or [[#set_by_lua_file|set_by_lua_file]].
zh_cn: * <code>set</code> : 可能是 [[#set_by_lua|set_by_lua]] 或 [[#set_by_lua_file|set_by_lua_file]] 上下文.

source: * <code>share_all_vars</code> : specify whether to share all the Nginx variables of the subrequest with the current (parent) request.
zh_cn: * <code>share_all_vars</code> : 指定是否将本（父）请求中的Nginx变量值与子请求共享。

source: * <code>success</code>: boolean value to indicate whether the key-value pair is stored or not.
zh_cn: * <code>success</code>: 布尔值，标明是否成功写入.

source: * <code>timer</code> : for the context of user callback functions for [[#ngx.timer.at|ngx.timer.*]].
zh_cn: * <code>timer</code> : 可能是 [[#ngx.timer.at|ngx.timer.*]] 的用户回调函数上下文.

source: * <code>vars</code> : take a Lua table which holds the values to set the specified Nginx variables in the subrequest as this option's value.
zh_cn: * <code>vars</code> : Lua table，其内部的值将作为子请求的Nginx 变量

source: * Applications: ** mysql: create database 'ngx_test', grant all privileges to user 'ngx_test', password is 'ngx_test' ** memcached
zh_cn: * 应用程序: ** mysql: create database 'ngx_test', grant all privileges to user 'ngx_test', password is 'ngx_test' ** memcached

source: * As the standard Lua 5.1 interpreter's VM is not fully resumable, the methods [[#ngx.location.capture|ngx.location.capture]], [[#ngx.location.capture_multi|ngx.location.capture_multi]], [[#ngx.redirect|ngx.redirect]], [[#ngx.exec|ngx.exec]], and [[#ngx.exit|ngx.exit]] cannot be used within the context of a Lua [http://www.lua.org/manual/5.1/manual.html#pdf-pcall pcall()] or [http://www.lua.org/manual/5.1/manual.html#pdf-xpcall xpcall()] or even the first line of the <code>for ... in ...</code> statement when the standard Lua 5.1 interpreter is used and the <code>attempt to yield across metamethod/C-call boundary</code> error will be produced.
zh_cn: * 由于标准的Lua 5.1 解释器虚拟机不是完全可恢复的, 如果使用标准的Lua 5.1 解释器， [[#ngx.location.capture|ngx.location.capture]], [[#ngx.location.capture_multi|ngx.location.capture_multi]], [[#ngx.redirect|ngx.redirect]], [[#ngx.exec|ngx.exec]], 和 [[#ngx.exit|ngx.exit]] 不能用于 Lua [http://www.lua.org/manual/5.1/manual.html#pdf-pcall pcall()] 或 [http://www.lua.org/manual/5.1/manual.html#pdf-xpcall xpcall()] 的上下文甚至是 <code>for ... in ...</code> 语句的第一行，会产生 <code>attempt to yield across metamethod/C-call boundary</code> 错误.

source: * C libraries: ** yajl: https://github.com/lloyd/yajl
zh_cn: * C 库: ** yajl: https://github.com/lloyd/yajl
